[
  {
    "id": 1,
    "title": "Firewood Steakhouse ",
    "description": "A modern steakhouse app built with Flutter, featuring dark mode, dynamic cart, and secure payment integration.",
    "details": "Firewood Steakhouse is a Flutter-based mobile application aimed at enhancing the food ordering experience. The app organizes food into four categories—steaks, platters, desserts, and drinks allowing users to switch between them easily via a tab bar. Each item provides detailed information, including price, description, and available addons, giving users full customization options. The app supports both dark and light modes for a comfortable viewing experience, and includes location selection (under development) for future location-based services and order tracking. A fully functional cart system ensures smooth order management, letting users add, update, or remove items dynamically. For real-world payment functionality, the app integrates bKash and SSLCOMMERZ, processing payments at actual item prices. The backend connection with Firebase is currently in progress, which will manage user authentication, order storage, and real-time updates. This project demonstrates practical skills in Flutter development, UI/UX design, payment gateway integration, and backend connectivity, reflecting the ability to build a secure, modern, and user-friendly food delivery application suitable for real-world use.",
    "isVertical": true,
    "head": [
      "https://i.ibb.co.com/TBqTry6C/steakhouse1.png",
      "https://i.ibb.co.com/cS2WyjM5/steakhouse3.png",
      "https://i.ibb.co.com/VWqWhqfy/steakhouse9.png"
    ],
    "imgs": [
      "https://i.ibb.co.com/TBqTry6C/steakhouse1.png",
      "https://i.ibb.co.com/v6ssCBFL/steakhouse2.png",
      "https://i.ibb.co.com/cS2WyjM5/steakhouse3.png",
      "https://i.ibb.co.com/q3McpwP5/steakhouse4.png",
      "https://i.ibb.co.com/yFxFBpwQ/steakhouse5.png",
      "https://i.ibb.co.com/JjyR78x7/steakhouse6.png",
      "https://i.ibb.co.com/HfRD00sf/steakhouse7.png",
      "https://i.ibb.co.com/Hfm93T12/steakhouse8.png",
      "https://i.ibb.co.com/VWqWhqfy/steakhouse9.png",
      "https://i.ibb.co.com/LXd4T5GD/steakhouse10.png",
      "https://i.ibb.co.com/KxjxJtFz/steakhouse11.png",
      "https://i.ibb.co.com/WvxJPf2X/steakhouse12.png",
      "https://i.ibb.co.com/qYpjSMpS/steakhouse13.png",
      "https://i.ibb.co.com/fdzShfb2/steakhouse14.png",
      "https://i.ibb.co.com/27yzhdfn/steakhouse15.png",
      "https://i.ibb.co.com/kVwbxXXG/steakhouse16.png"  
    ]
  },
  {
    "id": 2,
    "title": "Dice Roller App ",
    "description": "A simple mobile app that simulates rolling a dice, displaying a random dice side when a button is pressed.",
    "details": "The Dice Roller App is a lightweight mobile application developed using Flutter and Dart, designed for entertainment and simplicity. The core functionality involves generating a random number between 1 and 6 whenever the user presses the roll button, simulating the rolling of a standard dice. The app dynamically updates the displayed dice image to correspond with the generated number, providing a realistic dice-rolling experience. Built with Flutter's intuitive UI components, this app delivers a responsive and visually appealing interface. Its clean and efficient code structure ensures smooth performance across various mobile devices. The Dice Roller App serves as an excellent showcase of Flutter's capabilities for creating engaging mobile applications with minimal resources.",
    "head": "https://i.ibb.co.com/1MxSScD/Whats-App-Image-2024-12-07-at-12-00-22-PM-2.jpg",
    "imgs": [
      "https://i.ibb.co.com/1MxSScD/Whats-App-Image-2024-12-07-at-12-00-22-PM-2.jpg",
      "https://i.ibb.co.com/T4swFB8/Whats-App-Image-2024-12-07-at-12-00-22-PM-1.jpg",
      "https://i.ibb.co.com/Yt8Zcbj/Whats-App-Image-2024-12-07-at-12-00-23-PM.jpg",
      "https://i.ibb.co.com/WyxknYL/Whats-App-Image-2024-12-07-at-12-00-22-PM.jpg",
      "https://i.ibb.co.com/hdBgQ2m/Whats-App-Image-2024-12-07-at-12-00-23-PM-2.jpg",
      "https://i.ibb.co.com/s9Y1K4Y/Whats-App-Image-2024-12-07-at-12-00-23-PM-1.jpg"
    ]
  },
  {
    "id": 3,
    "title": "Fabrino ",
    "description": "A simple, scalable, and user-friendly e-commerce app designed to make online shopping effortless, organized, and enjoyable.",
    "details": "Fabrino is a mobile e-commerce application designed for clothing and accessories, offering a smooth and organized shopping experience for both men and women. The app categorizes products into sections such as T-shirts, jeans, Punjabi, Kurti, pants, wallets, and face masks, allowing users to quickly explore their preferred items. Each product provides essential details including name, price, image, and available sizes, helping customers make informed choices with ease. A clean and scrollable interface ensures clarity, while smooth navigation allows users to move effortlessly between categories and product pages. A key feature of Fabrino is its multi-size support, enabling users to check size availability before purchase, which enhances convenience and efficiency. The project emphasizes simplicity and usability, making shopping straightforward and enjoyable. Planned future enhancements include implementing user registration and login, enabling account creation, shopping cart management, and a streamlined checkout system. Integration with a real database is also planned, allowing user information and purchase history to be stored securely, making the app fully functional in real-world scenarios. Overall, Fabrino demonstrates the development of a user-friendly, expandable e-commerce solution that combines organized product management, seamless navigation, and a strong foundation for future scalability.",
    "isVertical": true,
    "head": [
      "https://i.ibb.co.com/rBKgn0G/fabrino1.png",
      "https://i.ibb.co.com/wFttmdB1/fabrino2.png",
      "https://i.ibb.co.com/XfcH1QXM/fabrino6.png"
    ],
    "imgs": [
      "https://i.ibb.co.com/rBKgn0G/fabrino1.png",
      "https://i.ibb.co.com/wFttmdB1/fabrino2.png",
      "https://i.ibb.co.com/7xvYDvFd/fabrino3.png",
      "https://i.ibb.co.com/DD4ZDD4v/fabrino4.png",
      "https://i.ibb.co.com/WNvyHtKP/fabrino5.png",
      "https://i.ibb.co.com/XfcH1QXM/fabrino6.png"
    ]
  },
  
  {
    "id": 4,
    "title": "LibraryHub ",
    "description": "A role-based library management system built with NestJS and Next.js, supporting real-time coordination and secure user workflows.",
    "details": "LibraryHub is a comprehensive full-stack library management system developed using NestJS for the backend and Next.js for the frontend. It is designed to streamline library operations through real-time synchronization and role-based access control. The system supports three user roles: Admin, Librarian, and Student, each having a separate dashboard with their specific functionalities. Admins can approve or reject newly registered librarians, manage users, add, update, and delete books, change transaction statuses like issue or return, and temporarily block students. Librarians can manage the book inventory, handle book requests from students, and carry out regular library tasks after admin approval. Students can view available books, send book requests, and track their request and transaction statuses. The system features secure authentication using JWT, OTP-based password reset via email, and profile management for all users. All actions are instantly synchronized across the system to ensure real-time updates. This project demonstrates seamless frontend-backend integration, clean API design, and a focus on usability, security, and maintainability.",
    "head": "https://i.ibb.co.com/ccrN1PF1/IMG-20250716-WA0003.jpg",
    "imgs": [
      "https://i.ibb.co.com/SXWqnsV3/IMG-20250716-WA0002.jpg",
      "https://i.ibb.co.com/ccrN1PF1/IMG-20250716-WA0003.jpg",
      "https://i.ibb.co.com/0yjFbhwd/IMG-20250716-WA0004.jpg",
      "https://i.ibb.co.com/FLBqW7xm/IMG-20250716-WA0005.jpg",
      "https://i.ibb.co.com/8yLn7Qn/IMG-20250716-WA0006.jpg",
      "https://i.ibb.co.com/27SXc0pR/IMG-20250716-WA0007.jpg",
      "https://i.ibb.co.com/pBfSTvH6/IMG-20250716-WA0008.jpg",
      "https://i.ibb.co.com/qM41knRZ/IMG-20250716-WA0009.jpg",
      "https://i.ibb.co.com/GfB9nPjC/IMG-20250716-WA0010.jpg",
      "https://i.ibb.co.com/Jwgx92G4/IMG-20250716-WA0011.jpg",
      "https://i.ibb.co.com/h1Y0vfH0/IMG-20250716-WA0012.jpg",
      "https://i.ibb.co.com/bjh04ZDy/IMG-20250716-WA0013.jpg",
      "https://i.ibb.co.com/mrM1Dxs1/IMG-20250716-WA0014.jpg",
      "https://i.ibb.co.com/Z60Xg9CT/IMG-20250716-WA0015.jpg"
    ]
  },
  {
    "id": 5,
    "title": "UniGuide ",
    "description": "An app designed to help students select suitable universities, currently focused on universities in Bangladesh.",
    "details": "UniGuide is a Java-based application tailored to assist students in making informed decisions about their higher education. This application provides a curated list of universities in Bangladesh, along with detailed information such as courses offered, admission requirements, and rankings. It uses a structured data handling approach to manage large volumes of university data efficiently. The user-friendly interface allows students to search and filter universities based on specific criteria, such as location, field of study, or academic scores. Future updates aim to expand its scope to include universities from other countries, transforming it into a global university recommendation tool. UniGuide demonstrates the effective use of Java for managing data-heavy applications and highlights my commitment to addressing real-world challenges faced by students.",
    "head": "https://i.ibb.co.com/p0wvKbT/7872e67f-a32b-4993-b367-0b7703b1a749.jpg",
    "imgs": [
      "https://i.ibb.co.com/p0wvKbT/7872e67f-a32b-4993-b367-0b7703b1a749.jpg",
      "https://i.ibb.co.com/gM2YGsC/f3e96807-e299-46ca-bdce-1f166fb37037.jpg",

      "https://i.ibb.co.com/9T3m488/811d8561-6d41-4d07-a474-388e470742b4.jpg",

      "https://i.ibb.co.com/z6zbxx1/588bc5fe-5b92-4656-8afa-ba70828d3bff.jpg",
      " https://i.ibb.co.com/xCqzLfx/Whats-App-Image-2024-12-07-at-1-19-23-PM.jpg",
      "https://i.ibb.co.com/JHm01P7/03894f18-67cb-45fd-8606-370489285729.jpg",
      "https://i.ibb.co.com/QKV16dx/7636b477-a74c-45f3-a619-5666f06623c9.jpg",
      "https://i.ibb.co.com/mvQdtWq/Whats-App-Image-2024-12-07-at-1-19-23-PM-1.jpg"
    ]
  },
  {
    "id": 6,
    "title": "Inventory Management System",
    "description": "A C# application for managing store inventories, supporting CRUD operations for tracking products efficiently.",
    "details": "The Inventory Management System is a robust application developed in C# to simplify store management tasks. It enables users to perform essential operations, including creating, reading, updating, and deleting product records. Each product is assigned a unique ID, ensuring accurate tracking and management. The system allows store owners to monitor stock levels, organize product details, and streamline inventory processes effectively. With a focus on ease of use, the application features a clean interface that minimizes the learning curve for non-technical users. It incorporates error-handling mechanisms to prevent data inconsistencies and ensure reliability. The project is an excellent example of how C# can be utilized to build practical solutions for small to medium-sized businesses, highlighting my ability to develop applications that address real-world business needs",
    "head": "https://i.ibb.co.com/Hz4fn27/Whats-App-Image-2024-12-07-at-1-27-29-PM.jpg",
    "imgs": [
      "https://i.ibb.co.com/Hz4fn27/Whats-App-Image-2024-12-07-at-1-27-29-PM.jpg",
      "https://i.ibb.co.com/bRVMTRT/Whats-App-Image-2024-12-07-at-1-27-30-PM.jpg",
      "https://i.ibb.co.com/kgm0NSW/Whats-App-Image-2024-12-07-at-1-27-30-PM-1.jpg",
      "https://i.ibb.co.com/z2rYc4x/Whats-App-Image-2024-12-07-at-1-27-30-PM-2.jpg",
      "https://i.ibb.co.com/D5fwXRk/Whats-App-Image-2024-12-07-at-1-27-31-PM.jpg",
      "https://i.ibb.co.com/yqD9qSw/Whats-App-Image-2024-12-07-at-1-27-31-PM-1.jpg",
      "https://i.ibb.co.com/Qkh3ntY/Whats-App-Image-2024-12-07-at-1-27-31-PM-2.jpg",
      "https://i.ibb.co.com/BNGdtn3/Whats-App-Image-2024-12-13-at-2-06-41-AM.jpg"
    ]
  }
]
